madhephaestus/WiiChuck/Adafruit_BLEFirmata/examples/BluefruitLE_nrf51822/BluefruitLE_nrf51822.ino
        /*
        FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.print(INPUT, HEX);
        FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.print(1, HEX);
        FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.print(OUTPUT, HEX);
        FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.println(1, HEX);
        */
        delay(20);
      } else {
        bluefruit.write(127);
        //FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.println(127, HEX);
        delay(20);
        continue;
      }
      if (BLE_Firmata.IS_PIN_ANALOG(pin)) {
        bluefruit.write(ANALOG);
        bluefruit.write(10);
        
        //FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.print(ANALOG, HEX);  FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.println(10, HEX);
        delay(20);
      }
      if (BLE_Firmata.IS_PIN_PWM(pin)) {
        bluefruit.write(PWM);
        bluefruit.write(8);

        //FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.print(PWM, HEX); FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.println(8, HEX);
        delay(20);
      }
      if (BLE_Firmata.IS_PIN_SERVO(pin)) {
        bluefruit.write(SERVO);
        bluefruit.write(14);

        //FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.print(SERVO, HEX);FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.println(14, HEX);
        delay(20);
      }
      if (BLE_Firmata.IS_PIN_I2C(pin)) {
        bluefruit.write(I2C);
        bluefruit.write(1);  // to do: determine appropriate value 
        delay(20);
      }
      bluefruit.write(127);
      //FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.println(127, HEX);
    }
    bluefruit.write(END_SYSEX);
    //FIRMATADEBUG.print(" 0x"); FIRMATADEBUG.println(END_SYSEX, HEX);
    break;
  case PIN_STATE_QUERY:
    if (argc > 0) {
      byte pin=argv[0];
      bluefruit.write(START_SYSEX);
      bluefruit.write(PIN_STATE_RESPONSE);
      bluefruit.write(pin);
      if (pin < TOTAL_PINS) {
        bluefruit.write((byte)pinConfig[pin]);
	bluefruit.write((byte)pinState[pin] & 0x7F);
	if (pinState[pin] & 0xFF80) bluefruit.write((byte)(pinState[pin] >> 7) & 0x7F);
	if (pinState[pin] & 0xC000) bluefruit.write((byte)(pinState[pin] >> 14) & 0x7F);
      }
      bluefruit.write(END_SYSEX);
    }
    break;
  case ANALOG_MAPPING_QUERY:
    FIRMATADEBUG.println("Analog mapping query");
    bluefruit.write(START_SYSEX);
    bluefruit.write(ANALOG_MAPPING_RESPONSE);
    for (byte pin=0; pin < TOTAL_PINS; pin++) {
      bluefruit.write(BLE_Firmata.IS_PIN_ANALOG(pin) ? BLE_Firmata.PIN_TO_ANALOG(pin) : 127);
    }
    bluefruit.write(END_SYSEX);
    break;
  }
}

void enableI2CPins()
{
  byte i;
  // is there a faster way to do this? would probaby require importing 
  // Arduino.h to get SCL and SDA pins
  for (i=0; i < TOTAL_PINS; i++) {
    if(BLE_Firmata.IS_PIN_I2C(i)) {
      // mark pins as i2c so they are ignore in non i2c data requests
      setPinModeCallback(i, I2C);
    } 
  }
   
  isI2CEnabled = true; 
  
  // is there enough time before the first I2C request to call this here?
  Wire.begin();
}

/* disable the i2c pins so they can be used for other functions */
void disableI2CPins() {
    isI2CEnabled = false;
    // disable read continuous mode for all devices
    queryIndex = -1;
    // uncomment the following if or when the end() method is added to Wire library
    // Wire.end();
}

/*==============================================================================
 * SETUP()
 *============================================================================*/

void systemResetCallback()
{
  // initialize a defalt state
  FIRMATADEBUG.println(F("***RESET***"));
  // TODO: option to load config from EEPROM instead of default
  if (isI2CEnabled) {
  	disableI2CPins();
  }
  for (byte i=0; i < TOTAL_PORTS; i++) {
    reportPINs[i] = false;      // by default, reporting off
    portConfigInputs[i] = 0;	// until activated
    previousPINs[i] = 0;
  }
  // pins with analog capability default to analog input
  // otherwise, pins default to digital output
  for (byte i=0; i < TOTAL_PINS; i++) {
    if (BLE_Firmata.IS_PIN_ANALOG(i)) {
      // turns off pullup, configures everything
      setPinModeCallback(i, ANALOG);
    } else {
      // sets the output to 0, configures portConfigInputs
      setPinModeCallback(i, INPUT);
    }
  }
  // by default, do not report any analog inputs
  analogInputsToReport = 0;

  /* send digital inputs to set the initial state on the host computer,
   * since once in the loop(), this firmware will only send on change */
  /*
  TODO: this can never execute, since no pins default to digital input
        but it will be needed when/if we support EEPROM stored config
  for (byte i=0; i < TOTAL_PORTS; i++) {
    outputPort(i, readPort(i, portConfigInputs[i]), true);
  }
  */
}

void setup() 
{
  if (WAITFORSERIAL) {
    while (!FIRMATADEBUG) delay(1);
  }
  
  FIRMATADEBUG.begin(9600);
  FIRMATADEBUG.println(F("Adafruit Bluefruit LE Firmata test"));
  
  FIRMATADEBUG.print("Total pins: "); FIRMATADEBUG.println(NUM_DIGITAL_PINS);
  FIRMATADEBUG.print("Analog pins: "); FIRMATADEBUG.println(sizeof(boards_analogiopins));
  //for (uint8_t i=0; i<sizeof(boards_analogiopins); i++) {
  //  FIRMATADEBUG.println(boards_analogiopins[i]);
  //}
  
  BLE_Firmata.setUsablePins(boards_digitaliopins, sizeof(boards_digitaliopins), 
    boards_analogiopins, sizeof(boards_analogiopins),
    boards_pwmpins, sizeof(boards_pwmpins),
    boards_servopins, sizeof(boards_servopins), SDA, SCL);

  /* Initialise the module */
  FIRMATADEBUG.print(F("Initialising the Bluefruit LE module: "));

  if ( !bluefruit.begin(VERBOSE_MODE) )
  {
    error(F("Couldn't find Bluefruit, make sure it's in CoMmanD mode & check wiring?"));
  }
  
  FIRMATADEBUG.println( F("OK!") );

  /* Perform a factory reset to make sure everything is in a known state */
  FIRMATADEBUG.println(F("Performing a factory reset: "));
  if (! bluefruit.factoryReset() ){
       error(F("Couldn't factory reset"));
  }

  /* Disable command echo from Bluefruit */
  bluefruit.echo(false);

  FIRMATADEBUG.println("Requesting Bluefruit info:");
  /* Print Bluefruit information */
  bluefruit.info();
  
  FIRMATADEBUG.println("Setting name to BLE Firmata");
  bluefruit.println("AT+GAPDEVNAME=BLE_Firmata");
  
  BTLEstatus = false;
}

